公司搬家后VMWARE网络无法连接问题处理

原因分析：搬家后，网关发生变化，修改虚拟机NAT与虚机操作系统网关，使本地与虚拟机使用同一网关，两个IP在同一网段，即可恢复。

1 查看本地网络连接的设置
   本地C：>ipconfig
   哪个适配器在上网，用哪个，我是本地无线网，信息如下：   
   IPv4 地址 . . . . . . . . . . . . : 172.16.100.64
   子网掩码  . . . . . . . . . . . . : 255.255.252.0
   默认网关. . . . . . . . . . . . . : 172.16.100.1
   
2 启动VMware,找到要启动的虚拟机，在上面的菜单中选择“编辑——虚拟网络编辑器”
  VMnet8  - 更新设置（获得管理员权限）  - NAT设置
  网关IP（G）：172.16.100.1  （修改网关如左）
  
3 启动或进入虚拟机的操作系统，点击右上角的网络的图标，修改配置如下：
  IPv4 地址 . . . . . . . . . . . . : 172.16.100.128
  子网掩码  . . . . . . . . . . . . : 255.255.252.0
  默认网关. . . . . . . . . . . . . : 172.16.100.1
  128也可以换成非 0，128，在256以内的其它数字。
4 双向测试一下
  虚拟机访问百度
  Xshell访问虚拟机
  
  steven 2020.6.26
